<template>
    <Article title="What is gospel" sub-title="什么是福音" :sections="sections" :reference="reference" />
</template>

<script setup lang="ts">
import Article, { type Reference } from '@/components/Article.vue'

const sections = [
    {
        title: '1. 关于神',
        paragraphs: [
            '起初，神创造天地。（创世记 1:1）',
            '神就照着自己的形像造人，乃是照着他的形像造男造女。（创世记 1:27）',
            '亲爱的弟兄啊，我们应当彼此相爱，因为爱是从神来的。凡有爱心的，都是由神而生，并且认识神。没有爱心的，就不认识神，因为神就是爱。神差他独生子到世间来，使我们藉着他得生，神爱我们的心在此就显明了。不是我们爱神，乃是神爱我们，差他的儿子为我们的罪作了挽回祭，这就是爱了。（约翰一书 4:7-10）'
        ]
    },
    {
        title: '2. 关于罪和惩罚',
        paragraphs: [
            '因为世人都犯了罪，亏缺了神的荣耀，（罗马书 3:23）',
            '因为罪的工价乃是死；惟有神的恩赐，在我们的主基督耶稣里，乃是永生。（罗马书 6:23）',
            '惟有胆怯的、不信的、可憎的、杀人的、淫乱的、行邪术的、拜偶像的和一切说谎话的，他们的份就在烧着硫磺的火湖里，这是第二次的死。（启示录 21:8）'
        ]
    },
    {
        title: '3. 关于耶稣基督',
        paragraphs: [
            '耶稣受了洗，随即从水里上来。天忽然为他开了，他就看见神的灵仿佛鸽子降下，落在他身上。从天上有声音说：“这是我的爱子，我所喜悦的。”（马太福音 3:16-17）',
            '耶稣走遍各城各乡，在会堂里教训人，宣讲天国的福音，又医治各样的病症。他看见许多的人，就怜悯他们；因为他们困苦流离，如同羊没有牧人一般。（马太福音 9:35-36）',
            '因为世人都犯了罪，亏缺了神的荣耀；如今却蒙神的恩典，因基督耶稣的救赎，就白白地称义。神设立耶稣作挽回祭，是凭着耶稣的血，藉着人的信，要显明神的义。（罗马书 3:23-25）',
            '所以弟兄们，你们当晓得，赦罪的道是由这人传给你们的。你们靠摩西的律法，在一切不得称义的事上信靠这人，就都得称义了。（使徒行传 13:38-39）'
        ]
    },
    {
        title: '4. 关于命令和应许',
        paragraphs: [
            '从那时候，耶稣就传起道来，说：“天国近了，你们应当悔改！”（马太福音 4:17）',
            '所以弟兄们，你们当晓得，赦罪的道是由这人传给你们的。你们靠摩西的律法，在一切不得称义的事上信靠这人，就都得称义了。（使徒行传 13:39）',
            '“神爱世人，甚至将他的独生子赐给他们，叫一切信他的，不至灭亡，反得永生。”（约翰福音 3:16）'
        ]
    }
]

const reference: Reference = {
    text: '福音到底是什么?',
    link: 'https://simai.life/index.php/node/155'
}
</script>